// //1 Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
const arr1 = [1, 2, 3];
const arr2 = [4, 5, 6];
const arrNew = arr1.concat(arr2);

//2 Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].
const arr = [1, 2, 3];
arr.reverse();

//3 Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
const arr = [1, 2, 3];
arr.push(4, 5, 6);

//4 Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
const arr = [1, 2, 3];
arr.unshift(4, 5, 6);

//5 Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.
const arr = ["js", "css", "jq"];
const arr1 = arr.shift();

//6 Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.
const arr = ["js", "css", "jq"];
const arr1 = arr.pop();

//7 Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [1, 2, 3].
const arr = [1, 2, 3, 4, 5];
const arr1 = arr.slice(0, 3);

//8 Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [4, 5].
const arr = [1, 2, 3, 4, 5];
const arr1 = arr.slice(-2);

//9 Дан массив [1, 2, 3, 4, 5]. С помощью метода преобразуйте массив в [1, 4, 5].
const arr = [1, 2, 3, 4, 5];
arr.splice(1, 2);

//10 Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [2, 3, 4].
const arr = [1, 2, 3, 4, 5];
const arr1 = arr.splice(1, 3);

//11 Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
const arr = [1, 2, 3, 4, 5];
arr.splice(3, 0, "a", "b", "c");

//12 Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
const arr = [1, 2, 3, 4, 5];
arr.splice(1, 0, "a", "b");
arr.splice(6, 0, "c");
arr.splice(8, 0, "e");

//13 Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.
const arr = [3, 4, 1, 2, 7];
arr.sort();

//14 Дан массив с числами [5, 6, 7, 8, 9]. Найдите сумму этих чисел.
const arr = [5, 6, 7, 8, 9];
let sum = 0;
arr.forEach(function (element) {
  sum += element;
});

//15 Дан массив с числами [5, 6, 7, 8, 9]. Сделайте из него массив, состоящий из квадратов этих чисел.
const arr = [5, 6, 7, 8, 9];
const arr1 = [];
arr.forEach(function (element) {
  arr1.push(element * element);
});

//16 Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только отрицательные числа.
const arr = [1, -3, 5, 6, -7, 8, 9, -11];
let result = arr.filter(function (element) {
  return element < 0;
});

//17 Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только четные числа.
const arr = [1, -3, 5, 6, -7, 8, 9, -11];
let result = arr.filter(function (element) {
  return element % 2 == 0;
});

//18 Дан массив со строками ['aaa', 'aaaqqq', 'zzzqq', 'zz', 'qsaa', 'q', 'az']. Оставьте в нем только те строки, длина которых больше 5-ти символов.
const arr = ["aaa", "aaaqqq", "zzzqq", "zz", "qsaa", "q", "az"];
let result = arr.filter(function (element) {
  return element.length > 5;
});

//19 Дан массив, в нем могут быть обычные элементы и подмассивы, например [1, 2, [3, 4], 5, [6, 7]]. Оставьте в нем только подмассивы.
const arr = [1, 2, [3, 4], 5, [6, 7]];
let result = arr.filter(function (element) {
  return Array.isArray(element);
});

//20 Дан массив с числами [5,-3, 6,-5, 0,-7, 8, 9]. Посчитайте количество отрицательных чисел в этом массиве.
const arr = [5, -3, 6, -5, 0, -7, 8, 9];
let result = arr.filter(function (element) {
  return element < 0;
});
let result1 = result.length;
